tap "1password/tap"
tap "cormacrelf/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mhanberg/zk"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Code searching, linting, rewriting
brew "ast-grep"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Statistics utility to count lines of code
brew "cloc"
# Fix common misspellings in source code and text files
brew "codespell"
# Color-highlighted diff(1) output
brew "colordiff"
# SQL-like query language for csv
brew "csvq"
# Load/unload environment variables based on $PWD
brew "direnv"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Run arbitrary commands when files change
brew "entr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Library for USB device access
brew "libusb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Make JSON greppable
brew "gron"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Command-line pager for JSON data
brew "jless"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Exposes your localhost to the world for easy testing and sharing
brew "localtunnel"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Package manager for the Lua programming language
brew "luarocks"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# Object-relational database system
brew "postgresql@15"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Microsoft SQL Server command-line interface
brew "sqlcmd"
# Cross-shell prompt for astronauts
brew "starship"
# TCP port forwarder
brew "tcptunnel"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Source code spell checker
brew "typos-cli"
# Maintained ctags implementation
brew "universal-ctags"
# Tool for writing command-line pipes with instant live preview
brew "up"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Format XML documents
brew "xmlformat"
# Plain text note-taking assistant
brew "zk"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Enable Windows-like alt-tab
cask "alt-tab"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-hack-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Keyboard customiser
cask "karabiner-elements"
# Software for Logitech devices
cask "logitech-options"
# Online collaborative whiteboard platform
cask "miro"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Music streaming service
cask "spotify"
# To-do list
cask "todoist"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "asvetliakov.vscode-neovim"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "stylelint.vscode-stylelint"
vscode "zengxingxin.sort-js-object-keys"
