### Work
saml2aws
gpg
slack

### Shell & dev
asdf
awscli
bash
bat
direnv
fd
fzf
git
git-delta
htop
jq
lua@5.1
neovim
postgresql
ripgrep
rust
the_silver_searcher
tree
universal-ctags
wget

### MacOS
# amethyst
# skhd
cormacrelf/tap/dark-notify
homebrew/cask-versions/iterm2-beta
karabiner-elements
rectangle

### Misc
libusb
# wally-cli
mhanberg/zk/zk

### Remove
# zoxide

### New
hammerspoon
luarocks
lua-language-server
platformio
macdown
intellij-idea-ce
intellij-idea
--cask miro
ffmpeg
tig
ncdu
imagemagick
--cask signal
--cask homebrew/cask-drivers/qmk-toolbox
--cask vial
--cask via
jo
colordiff
gron
--cask visual-studio-code
newman
