{
  "Comment.nvim": { "branch": "master" },
  "HighStr.nvim": { "branch": "main" },
  "SmoothCursor.nvim": { "branch": "main" },
  "asyncrun.vim": { "branch": "master" },
  "bufjump.nvim": { "branch": "master" },
  "cmp-buffer": { "branch": "main" },
  "cmp-calc": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-emoji": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lsp-document-symbol": { "branch": "main" },
  "cmp-nvim-lsp-signature-help": { "branch": "main" },
  "cmp-omni": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-tabnine": { "branch": "main" },
  "cmp-vsnip": { "branch": "main" },
  "colorful-winsep.nvim": { "branch": "main" },
  "committia.vim": { "branch": "master" },
  "copilot-cmp": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "diffview.nvim": { "branch": "main" },
  "fugitive-gitlab.vim": { "branch": "master" },
  "github-nvim-theme": { "branch": "0.0.x" },
  "gitsigns.nvim": { "branch": "main" },
  "gv.vim": { "branch": "master" },
  "headlines.nvim": { "branch": "master" },
  "highlight-undo.nvim": { "branch": "main" },
  "impatient.nvim": { "branch": "main" },
  "inc-rename.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "kanagawa.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lsp-lens.nvim": { "branch": "main" },
  "lsp-zero.nvim": { "branch": "v2.x" },
  "lsp_signature.nvim": { "branch": "master" },
  "lspkind-nvim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "marks.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-null-ls.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neodev.nvim": { "branch": "main" },
  "neoscroll.nvim": { "branch": "master" },
  "null-ls.nvim": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-code-action-menu": { "branch": "main" },
  "nvim-lightbulb": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-lsputils": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-refactor": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-trevJ.lua": { "branch": "main" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "nvim-ufo": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "oil.nvim": { "branch": "master" },
  "overseer.nvim": { "branch": "master" },
  "paint.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "popfix": { "branch": "master" },
  "promise-async": { "branch": "main" },
  "s3edit.nvim": { "branch": "main" },
  "startuptime.vim": { "branch": "master" },
  "statuscol.nvim": { "branch": "main" },
  "tabnine-nvim": { "branch": "master" },
  "tabular": { "branch": "master" },
  "targets.vim": { "branch": "master" },
  "telescope-ag": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "telescope-vimwiki.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "0.1.x" },
  "tint.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "twoslash-queries.nvim": { "branch": "main" },
  "venn.nvim": { "branch": "main" },
  "vim-cool": { "branch": "master" },
  "vim-fetch": { "branch": "master" },
  "vim-fubitive": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gutentags": { "branch": "master" },
  "vim-indent-object": { "branch": "master" },
  "vim-ingo-library": { "branch": "master" },
  "vim-mark": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-python-pep8-indent": { "branch": "master" },
  "vim-repo-edit": { "branch": "main" },
  "vim-rhubarb": { "branch": "master" },
  "vim-rsi": { "branch": "master" },
  "vim-sandwich": { "branch": "master" },
  "vim-sleuth": { "branch": "master" },
  "vim-vsnip": { "branch": "master" },
  "vim-vsnip-integ": { "branch": "master" },
  "vimwiki": { "branch": "dev" },
  "which-key.nvim": { "branch": "main" },
  "winpick.nvim": { "branch": "trunk" },
  "winshift.nvim": { "branch": "main" },
  "zk-nvim": { "branch": "main" }
}